content/programming/kubernetes/kubernetes-resources.org
#+startup: content indent

* Kubernetes Resources
#+INDEX: Giovanni's Diary!Programming!Kubernetes!Resources
Here is a list of kubernetes learning resources stolen from the
book "Programming Kubernetes - Developing Cloud-Native Applications"
by Michael Hausenblas & Stefan Schimanski.

Some links may be broken.

** General
- The official Kubernetes Documentation: https://kubernetes.io/docs/home
- The Kubernetes community on GitHub: http://bit.ly/2LX2YF8
- The client-go docs channel on the Kubernetes Slack instance
- Kubernetes deep dive: API Server – Part 1: https://red.ht/2IJBDEk
- Kubernetes deep dive: API Server – Part 2: https://red.ht/2RAEv9s
- Kubernetes deep dive: API Server – Part 3: https://red.ht/2NaXgBD
- Kubernetes API Server, Part 1: http://bit.ly/2IKh0be
- The Mechanics of Kubernetes: http://bit.ly/2IV2lcb
- GoDoc for k8s.io/api: https://godoc.org/k8s.io/api

** Books
- Kubernetes: Up and Running, 2nd Edition – https://oreil.ly/2SaANU4 by Kelsey Hightower et al. (O’Reilly)
- Cloud Native DevOps with Kubernetes – https://oreil.ly/2BaE1iq by John Arundel and Justin Domingus (O’Reilly)
- Managing Kubernetes – https://oreil.ly/2wtHcAm by Brendan Burns and Craig Tracey (O’Reilly)
- Kubernetes Cookbook – http://bit.ly/2FTgJzk by Sébastien Goasguen and Michael Hausenblas (O’Reilly)
- The Kubebuilder Book – https://book.kubebuilder.io

** Tutorials and Examples
- Kubernetes by Example: http://kubernetesbyexample.com
- The Katacoda Kubernetes Playground: http://bit.ly/31Sydqp
- Banzai Cloud Operator SDK: http://bit.ly/2ZG3OtA
- Operator Developer Guide: http://bit.ly/2Fx4zh4

** Articles
- Writing a Kubernetes Operator in Golang: http://bit.ly/2Ei2hCr
- Stay Informed with Kubernetes Informers: http://bit.ly/2Y5OKYX
- Events, the DNA of Kubernetes: http://bit.ly/31Tvey8
- Kubernetes Events Explained: http://bit.ly/2XzwEOM
- Level Triggering and Reconciliation in Kubernetes: http://bit.ly/2FmLLAW
- Comparing Kubernetes Operator Pattern with Alternatives: http://bit.ly/2XxGEYO
- Kubernetes Operators: https://kubedex.com/operators
- Kubernetes Custom Resource, Controller, and Operator Development Tools: http://bit.ly/2FpO4Ug
- Demystifying Kubernetes Operators with the Operator SDK (Part 1): http://bit.ly/2NbGRwZ
- Under the Hood of Kubebuilder Framework: http://bit.ly/2X2NpgX
- Best Practices for Building Kubernetes Operators and Stateful Apps: http://bit.ly/2NdvQeJ
- Kubernetes Operator Development Guidelines: http://bit.ly/31P7rPC
- Mutating Webhooks with slok/kubewebhook: http://bit.ly/2RyScG1

** Repositories
- Kubernetes-client organization: http://bit.ly/2xfSrfT
- Kubernetes/kubernetes: http://bit.ly/2SltTLP
- Kubernetes/perf-tests: http://bit.ly/2X556g8
- CNCF/apisnoop: http://bit.ly/32u5SqN
- Open-policy-agent/gatekeeper: http://bit.ly/2LXCpiX
- Stakater/Konfigurator: http://bit.ly/2JBX8HO
- Ynqa/kubernetes-rust: https://github.com/ynqa/kubernetes-rust
- Hossainemruz/k8s-initializer-finalizer-practice: http://bit.ly/30GzTSF
- Munnerz/k8s-api-pager-demo: http://bit.ly/30Ep2IT
- M3db/m3db-operator: http://bit.ly/2XURVi2

-----

Travel: [[file:kubernetes.org][Kubernetes]], [[file:../../theindex.org][Index]]
