public/programming/kubernetes/kubernetes-resources.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="kubernetes.html">Kubernetes</a> &gt;
</p>

<div id="outline-container-orgdc7d225" class="outline-2">
<h2 id="orgdc7d225">Kubernetes Resources</h2>
<div class="outline-text-2" id="text-orgdc7d225">
<p>
Here is a list of kubernetes learning resources stolen from the
book "Programming Kubernetes - Developing Cloud-Native Applications"
by Michael Hausenblas &amp; Stefan Schimanski.
</p>

<p>
Some links may be broken.
</p>
</div>

<div id="outline-container-org6738498" class="outline-3">
<h3 id="org6738498">General</h3>
<div class="outline-text-3" id="text-org6738498">
<ul class="org-ul">
<li>The official Kubernetes Documentation: <a href="https://kubernetes.io/docs/home">https://kubernetes.io/docs/home</a></li>
<li>The Kubernetes community on GitHub: <a href="http://bit.ly/2LX2YF8">http://bit.ly/2LX2YF8</a></li>
<li>The client-go docs channel on the Kubernetes Slack instance</li>
<li>Kubernetes deep dive: API Server – Part 1: <a href="https://red.ht/2IJBDEk">https://red.ht/2IJBDEk</a></li>
<li>Kubernetes deep dive: API Server – Part 2: <a href="https://red.ht/2RAEv9s">https://red.ht/2RAEv9s</a></li>
<li>Kubernetes deep dive: API Server – Part 3: <a href="https://red.ht/2NaXgBD">https://red.ht/2NaXgBD</a></li>
<li>Kubernetes API Server, Part 1: <a href="http://bit.ly/2IKh0be">http://bit.ly/2IKh0be</a></li>
<li>The Mechanics of Kubernetes: <a href="http://bit.ly/2IV2lcb">http://bit.ly/2IV2lcb</a></li>
<li>GoDoc for k8s.io/api: <a href="https://godoc.org/k8s.io/api">https://godoc.org/k8s.io/api</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgad6bb32" class="outline-3">
<h3 id="orgad6bb32">Books</h3>
<div class="outline-text-3" id="text-orgad6bb32">
<ul class="org-ul">
<li>Kubernetes: Up and Running, 2nd Edition – <a href="https://oreil.ly/2SaANU4">https://oreil.ly/2SaANU4</a> by Kelsey Hightower et al. (O’Reilly)</li>
<li>Cloud Native DevOps with Kubernetes – <a href="https://oreil.ly/2BaE1iq">https://oreil.ly/2BaE1iq</a> by John Arundel and Justin Domingus (O’Reilly)</li>
<li>Managing Kubernetes – <a href="https://oreil.ly/2wtHcAm">https://oreil.ly/2wtHcAm</a> by Brendan Burns and Craig Tracey (O’Reilly)</li>
<li>Kubernetes Cookbook – <a href="http://bit.ly/2FTgJzk">http://bit.ly/2FTgJzk</a> by Sébastien Goasguen and Michael Hausenblas (O’Reilly)</li>
<li>The Kubebuilder Book – <a href="https://book.kubebuilder.io">https://book.kubebuilder.io</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7c7118b" class="outline-3">
<h3 id="org7c7118b">Tutorials and Examples</h3>
<div class="outline-text-3" id="text-org7c7118b">
<ul class="org-ul">
<li>Kubernetes by Example: <a href="http://kubernetesbyexample.com">http://kubernetesbyexample.com</a></li>
<li>The Katacoda Kubernetes Playground: <a href="http://bit.ly/31Sydqp">http://bit.ly/31Sydqp</a></li>
<li>Banzai Cloud Operator SDK: <a href="http://bit.ly/2ZG3OtA">http://bit.ly/2ZG3OtA</a></li>
<li>Operator Developer Guide: <a href="http://bit.ly/2Fx4zh4">http://bit.ly/2Fx4zh4</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd681859" class="outline-3">
<h3 id="orgd681859">Articles</h3>
<div class="outline-text-3" id="text-orgd681859">
<ul class="org-ul">
<li>Writing a Kubernetes Operator in Golang: <a href="http://bit.ly/2Ei2hCr">http://bit.ly/2Ei2hCr</a></li>
<li>Stay Informed with Kubernetes Informers: <a href="http://bit.ly/2Y5OKYX">http://bit.ly/2Y5OKYX</a></li>
<li>Events, the DNA of Kubernetes: <a href="http://bit.ly/31Tvey8">http://bit.ly/31Tvey8</a></li>
<li>Kubernetes Events Explained: <a href="http://bit.ly/2XzwEOM">http://bit.ly/2XzwEOM</a></li>
<li>Level Triggering and Reconciliation in Kubernetes: <a href="http://bit.ly/2FmLLAW">http://bit.ly/2FmLLAW</a></li>
<li>Comparing Kubernetes Operator Pattern with Alternatives: <a href="http://bit.ly/2XxGEYO">http://bit.ly/2XxGEYO</a></li>
<li>Kubernetes Operators: <a href="https://kubedex.com/operators">https://kubedex.com/operators</a></li>
<li>Kubernetes Custom Resource, Controller, and Operator Development Tools: <a href="http://bit.ly/2FpO4Ug">http://bit.ly/2FpO4Ug</a></li>
<li>Demystifying Kubernetes Operators with the Operator SDK (Part 1): <a href="http://bit.ly/2NbGRwZ">http://bit.ly/2NbGRwZ</a></li>
<li>Under the Hood of Kubebuilder Framework: <a href="http://bit.ly/2X2NpgX">http://bit.ly/2X2NpgX</a></li>
<li>Best Practices for Building Kubernetes Operators and Stateful Apps: <a href="http://bit.ly/2NdvQeJ">http://bit.ly/2NdvQeJ</a></li>
<li>Kubernetes Operator Development Guidelines: <a href="http://bit.ly/31P7rPC">http://bit.ly/31P7rPC</a></li>
<li>Mutating Webhooks with slok/kubewebhook: <a href="http://bit.ly/2RyScG1">http://bit.ly/2RyScG1</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcece14d" class="outline-3">
<h3 id="orgcece14d">Repositories</h3>
<div class="outline-text-3" id="text-orgcece14d">
<ul class="org-ul">
<li>Kubernetes-client organization: <a href="http://bit.ly/2xfSrfT">http://bit.ly/2xfSrfT</a></li>
<li>Kubernetes/kubernetes: <a href="http://bit.ly/2SltTLP">http://bit.ly/2SltTLP</a></li>
<li>Kubernetes/perf-tests: <a href="http://bit.ly/2X556g8">http://bit.ly/2X556g8</a></li>
<li>CNCF/apisnoop: <a href="http://bit.ly/32u5SqN">http://bit.ly/32u5SqN</a></li>
<li>Open-policy-agent/gatekeeper: <a href="http://bit.ly/2LXCpiX">http://bit.ly/2LXCpiX</a></li>
<li>Stakater/Konfigurator: <a href="http://bit.ly/2JBX8HO">http://bit.ly/2JBX8HO</a></li>
<li>Ynqa/kubernetes-rust: <a href="https://github.com/ynqa/kubernetes-rust">https://github.com/ynqa/kubernetes-rust</a></li>
<li>Hossainemruz/k8s-initializer-finalizer-practice: <a href="http://bit.ly/30GzTSF">http://bit.ly/30GzTSF</a></li>
<li>Munnerz/k8s-api-pager-demo: <a href="http://bit.ly/30Ep2IT">http://bit.ly/30Ep2IT</a></li>
<li>M3db/m3db-operator: <a href="http://bit.ly/2XURVi2">http://bit.ly/2XURVi2</a></li>
</ul>

<hr />

<p>
Travel: <a href="kubernetes.html">Kubernetes</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
